const express = require("express");
const cors = require("cors");

const app = express();

app.use(cors());
app.use(express.json());

app.get("/", (req, res, next) => {
  res.status(200).send("Hello World");
});

app.get("/get-food", (req, res, next) => {
  const foods = [
    "กะเพราหมูชิ้น",
    "กะเพราหมูกรอบ",
    "กะเพราหมูปิ้ง",
    "กะเพราปลาหมึก",
    "กะเพราไก่",
    "กะเพราหมูสับ",
    "กะเพราเนื้อ",
    "หมูกระเทียม",
    "ไก่กระเทียม",
    "เนื้อกระเทียม",
    "กะเพราเป็ด",
    "ราดหน้าทะเล",
    "บะหมี่ต้มยำ",
    "ข้าวมันไก่",
    "ข้าวขาหมู",
    "ข้าวหมูกรอบ",
    "ข้าวหมูแดง",
    "ข้าวหน้าเป็ด",
    "บะหมี่เป็ด",
    "มาม่าผัด",
    "ลาบคอหมู",
    "น้ำตกหมู",
    "กะเพราหมูหย็อง",
    "กะเพราเนื้อตุ๋น",
    "ผัดไทกุ้งสด",
    "หอยทอด",
    "ตำไทย",
    "ลาบหมู",
    "ไก่ย่าง",
    "ก๋วยเตี๋ยวเรือลูกชิ้นเนื้อสด",
    "หมูปิ้งพริกไทยดำ",
    "เย็นตาโฟ",
    "แกงป่า",
    "แกงส้ม",
    "ข้าวซอย",
    "ขนมจีนน้ำเงี้ยว",
    "ขนมจีนแกงเขียวหวาน",
    "ขนมจีนน้ำยา",
    "สุกี้",
    "ผัดมักโรนี",
    "ข้าวไข่เจียว",
    "ปลาดุกผัดพริก",
    "ไข่ลูกเขย",
    "ซุปเปอร์ตีนไก่",
    "สปาเก็ตตี้",
    "แกงจืด",
    "สะเดาน้ำปลาหวาน",
    "กุ้งพริกเกลือ",
    "น้ำพริกปลาทู",
    "ผัดหอยลาย",
    "ข้าวหน้าเนื้อ",
    "พะโล้",
    "คะน้าปลาเค็ม",
    "ยำวุ้นเส้น",
    "มัสมั่น",
    "กุ้งอบวุ้นเส้น",
    "ข้าวผัด",
    "ต้มข่าไก่",
    "ต้มยำ",
    "ยำหอยดอง",
    "หอยลายน้ำพริกเผา",
    "น้ำพริกกะปิ",
    "พแนงไก่",
    "สตูน่องไก่",
    "แกงไตปลา",
    "คั่วกลิ้ง",
    "ผัดผัก",
    "สตูไก่",
    "มาม่าเกาหลี",
    "ข้าวผัด",
    "ยำปลาทู",
    "กิมจิ",
    "หมูผัดพริกขิง",
    "ข้าวหมูอบ",
    "สเต๊กหมู",
    "สเต๊กไก่",
    "สเต๊กปลา",
    "ข้าวหมูทงคัตสึ",
    "สลัด",
  ];
  const rand = Math.floor(Math.random() * foods.length);
  res.status(200).send(foods[rand]);
});

app.listen(8888, () => {
  console.log("server is running on port 8888...");
});
